# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\PSoC Programs\clock_example_1.cydsn\clock_example_1.cyprj
# Date: Fri, 29 Aug 2025 18:48:09 GMT
#set_units -time ns
create_clock -name {CyXTAL} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/xtal}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_clock -name {CyILO} -period 10000 -waveform {0 5000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]


# Component constraints for D:\PSoC Programs\clock_example_1.cydsn\TopDesign\TopDesign.cysch
# Project: D:\PSoC Programs\clock_example_1.cydsn\clock_example_1.cyprj
# Date: Fri, 29 Aug 2025 18:48:06 GMT
